The only failure in the tests was the upgrade test.

```hcl
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:   + create
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: -/+ destroy and then create replacement
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: Terraform will perform the following actions:
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:   # module.etcd_db.ibm_resource_key.service_credentials["etcd_editor"] will be created
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:   + resource "ibm_resource_key" "service_credentials" {
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + account_id            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + created_at            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + created_by            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + credentials           = (sensitive value)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + credentials_json      = (sensitive value)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + crn                   = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + deleted_at            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + deleted_by            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + guid                  = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + iam_compatible        = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + id                    = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + name                  = "etcd_editor"
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + onetime_credentials   = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + resource_group_id     = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + resource_instance_id  = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:ff91e9c7-e3e9-4985-96c7-17f3e9ada53c::"
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + resource_instance_url = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + role                  = "Editor"
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + source_crn            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + state                 = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + status                = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + updated_at            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + updated_by            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + url                   = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:     }
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:   # module.etcd_db.ibm_resource_key.service_credentials["etcd_viewer"] must be replaced
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: -/+ resource "ibm_resource_key" "service_credentials" {
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ account_id            = "abac0df06b644a9cabc6e44f55b3880e" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ created_at            = "2024-08-22T14:05:35.934Z" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ created_by            = "IBMid-666000KAO3" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ credentials           = (sensitive value)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ credentials_json      = (sensitive value)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ crn                   = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:ff91e9c7-e3e9-4985-96c7-17f3e9ada53c:resource-key:735625fa-6dcc-4e01-bebe-43770068522e" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + deleted_at            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + deleted_by            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ guid                  = "735625fa-6dcc-4e01-bebe-43770068522e" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ iam_compatible        = false -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ id                    = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:ff91e9c7-e3e9-4985-96c7-17f3e9ada53c:resource-key:735625fa-6dcc-4e01-bebe-43770068522e" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:         name                  = "etcd_viewer"
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ onetime_credentials   = false -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ resource_group_id     = "f42eae225b1145ab81d4affe6adb4d6a" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ resource_instance_url = "/v2/resource_instances/ff91e9c7-e3e9-4985-96c7-17f3e9ada53c" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ role                  = "Editor" -> "Viewer" # forces replacement
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ source_crn            = "crn:v1:bluemix:public:databases-for-etcd:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:ff91e9c7-e3e9-4985-96c7-17f3e9ada53c::" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ state                 = "active" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ status                = "active" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ updated_at            = "2024-08-22T14:05:35.934Z" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       + updated_by            = (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:       ~ url                   = "/v2/resource_keys/735625fa-6dcc-4e01-bebe-43770068522e" -> (known after apply)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:         # (1 unchanged attribute hidden)
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185:     }
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: Plan: 2 to add, 0 to change, 1 to destroy.
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: ─────────────────────────────────────────────────────────────────────────────
TestRunCompleteUpgradeExample 2024-08-22T14:06:23Z command.go:185: 
```

This is essentially the bug that is being fixed. Previously the `viewer` and `editor` resources were merged into one called view with an editor property. During the upgrade the expected editor/editor is added and broken viewer/editor is recreated as viewer/viewer.

It is appropriate to skip the upgrade test.